## Plan Result (prod_general - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 25 to add, 4 to change, 16 to destroy.</code></pre>

* Create
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-prod-confluence-02&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-prod-confluence-04&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-prod-crowd-01&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-prod-gluster-01&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-prod-gluster-02&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-prod-gluster-03&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-prod-jira-01&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-prod-jira-02&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-prod-jira-03&#34;]
* Update
  * azurerm_application_gateway.ag
  * azurerm_key_vault.atlassian_kv
  * azurerm_postgresql_flexible_server.atlassian-flex-server
  * azurerm_postgresql_server.atlassian-server
* Replace
  * azurerm_virtual_machine.vm[&#34;atlassian-prod-confluence-02&#34;]
  * azurerm_virtual_machine.vm[&#34;atlassian-prod-confluence-04&#34;]
  * azurerm_virtual_machine.vm[&#34;atlassian-prod-crowd-01&#34;]
  * azurerm_virtual_machine.vm[&#34;atlassian-prod-gluster-01&#34;]
  * azurerm_virtual_machine.vm[&#34;atlassian-prod-gluster-02&#34;]
  * azurerm_virtual_machine.vm[&#34;atlassian-prod-gluster-03&#34;]
  * azurerm_virtual_machine.vm[&#34;atlassian-prod-jira-01&#34;]
  * azurerm_virtual_machine.vm[&#34;atlassian-prod-jira-02&#34;]
  * azurerm_virtual_machine.vm[&#34;atlassian-prod-jira-03&#34;]
  * azurerm_virtual_machine_data_disk_attachment.data_disk_attachment[&#34;atlassianprodconfluence02-datadisk-000-20250228-221025&#34;]
  * azurerm_virtual_machine_data_disk_attachment.data_disk_attachment[&#34;atlassianprodconfluence04-datadisk-000-20250228-221041&#34;]
  * azurerm_virtual_machine_data_disk_attachment.data_disk_attachment[&#34;atlassianprodgluster01-datadisk-000-20250228-221117&#34;]
  * azurerm_virtual_machine_data_disk_attachment.data_disk_attachment[&#34;atlassianprodgluster01-datadisk-001-20250228-221117&#34;]
  * azurerm_virtual_machine_data_disk_attachment.data_disk_attachment[&#34;atlassianprodgluster02-datadisk-000-20250228-221141&#34;]
  * azurerm_virtual_machine_data_disk_attachment.data_disk_attachment[&#34;atlassianprodgluster03-datadisk-000-20250228-221204&#34;]
  * azurerm_virtual_machine_data_disk_attachment.data_disk_attachment[&#34;atlassianprodjira01-datadisk-000-20250228-220516&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault_secret.POSTGRES-FLEX-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-FLEX-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "prod-POSTGRES-FLEX-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-FLEX-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-FLEX-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "prod-POSTGRES-FLEX-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "prod-POSTGRES-SINGLE-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "prod-POSTGRES-SINGLE-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_private_key will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_private_key" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "test-private-key"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_username will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_username" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "vm-admin-username"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azurerm_application_gateway.ag will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway"
        name                              = "atlassian-prod-app-gateway"
        tags                              = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      - probe {
          - id                                        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/probes/appgw-probe-cnf" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-cnf" -> null
          - path                                      = "/confluence" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/probes/appgw-probe-crd" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-crd" -> null
          - path                                      = "/crowd" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/probes/appgw-probe-jira" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-jira" -> null
          - path                                      = "/jira/status" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-cnf"
          + path                                      = "/confluence"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-crd"
          + path                                      = "/crowd"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-jira"
          + path                                      = "/jira/status"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }

      - request_routing_rule {
          - http_listener_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/httpListeners/appgw-http-listener" -> null
          - http_listener_name          = "appgw-http-listener" -> null
          - id                          = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/requestRoutingRules/appgw-routing-rule" -> null
          - name                        = "appgw-routing-rule" -> null
          - priority                    = 1 -> null
          - rule_type                   = "PathBasedRouting" -> null
          - url_path_map_id             = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/urlPathMaps/appgw-url-map-path" -> null
          - url_path_map_name           = "appgw-url-map-path" -> null
            # (8 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "appgw-backend-pool-cnf"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "appgw-backend-settings-cnf"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "appgw-http-listener"
          + id                          = (known after apply)
          + name                        = "appgw-routing-rule"
          + priority                    = 1
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "PathBasedRouting"
          + url_path_map_id             = (known after apply)
          + url_path_map_name           = "appgw-url-map-path"
            # (2 unchanged attributes hidden)
        }

        # (18 unchanged blocks hidden)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-prod-confluence-02"] will be created
  + resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupPolicies/atlassian-prod-vm-backup-policy"
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "atlassian-prod-rsv"
      + resource_group_name = "atlassian-prod-rg"
      + source_vm_id        = (known after apply)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-prod-confluence-04"] will be created
  + resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupPolicies/atlassian-prod-vm-backup-policy"
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "atlassian-prod-rsv"
      + resource_group_name = "atlassian-prod-rg"
      + source_vm_id        = (known after apply)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-prod-crowd-01"] will be created
  + resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupPolicies/atlassian-prod-vm-backup-policy"
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "atlassian-prod-rsv"
      + resource_group_name = "atlassian-prod-rg"
      + source_vm_id        = (known after apply)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-prod-gluster-01"] will be created
  + resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupPolicies/atlassian-prod-vm-backup-policy"
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "atlassian-prod-rsv"
      + resource_group_name = "atlassian-prod-rg"
      + source_vm_id        = (known after apply)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-prod-gluster-02"] will be created
  + resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupPolicies/atlassian-prod-vm-backup-policy"
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "atlassian-prod-rsv"
      + resource_group_name = "atlassian-prod-rg"
      + source_vm_id        = (known after apply)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-prod-gluster-03"] will be created
  + resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupPolicies/atlassian-prod-vm-backup-policy"
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "atlassian-prod-rsv"
      + resource_group_name = "atlassian-prod-rg"
      + source_vm_id        = (known after apply)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-prod-jira-01"] will be created
  + resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupPolicies/atlassian-prod-vm-backup-policy"
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "atlassian-prod-rsv"
      + resource_group_name = "atlassian-prod-rg"
      + source_vm_id        = (known after apply)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-prod-jira-02"] will be created
  + resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupPolicies/atlassian-prod-vm-backup-policy"
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "atlassian-prod-rsv"
      + resource_group_name = "atlassian-prod-rg"
      + source_vm_id        = (known after apply)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-prod-jira-03"] will be created
  + resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupPolicies/atlassian-prod-vm-backup-policy"
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "atlassian-prod-rsv"
      + resource_group_name = "atlassian-prod-rg"
      + source_vm_id        = (known after apply)
    }

  # azurerm_key_vault.atlassian_kv will be updated in-place
  ~ resource "azurerm_key_vault" "atlassian_kv" {
      ~ access_policy                   = [
            {
                application_id          = null
                certificate_permissions = []
                key_permissions         = []
                object_id               = "d309fbf5-9c92-470f-a11a-f307cf73fd00"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          + {
              + certificate_permissions = []
              + key_permissions         = []
              + object_id               = "d309fbf5-9c92-470f-a11a-f307cf73fd00"
              + secret_permissions      = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Purge",
                ]
              + storage_permissions     = []
              + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                # (1 unchanged attribute hidden)
            },
            {
                application_id          = null
                certificate_permissions = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "GetRotationPolicy",
                    "SetRotationPolicy",
                    "Rotate",
                ]
                object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            # (2 unchanged elements hidden)
        ]
        id                              = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
        name                            = "atlasssian-prod-kv"
        tags                            = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_postgresql_flexible_server.atlassian-flex-server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "atlassian-flex-server" {
      ~ administrator_password            = (sensitive value)
        id                                = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/atlassian-prod-flex-server"
        name                              = "atlassian-prod-flex-server"
        tags                              = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (18 unchanged attributes hidden)

      ~ authentication {
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_postgresql_server.atlassian-server will be updated in-place
  ~ resource "azurerm_postgresql_server" "atlassian-server" {
      ~ administrator_login_password            = (sensitive value)
        id                                      = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.DBforPostgreSQL/servers/atlassian-prod-server"
        name                                    = "atlassian-prod-server"
        tags                                    = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (17 unchanged attributes hidden)
    }

  # azurerm_virtual_machine.vm["atlassian-prod-confluence-02"] must be replaced
-/+ resource "azurerm_virtual_machine" "vm" {
      + availability_set_id              = (known after apply)
      ~ id                               = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-confluence-02" -> (known after apply)
      + license_type                     = (known after apply)
        name                             = "atlassian-prod-confluence-02"
        tags                             = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
      - zones                            = [] -> null
        # (7 unchanged attributes hidden)

      ~ storage_data_disk (known after apply)
      - storage_data_disk {
          - caching                   = "ReadOnly" -> null
          - create_option             = "Attach" -> null
          - disk_size_gb              = 128 -> null
          - lun                       = 0 -> null
          - managed_disk_id           = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/disks/atlassianprodconfluence02-datadisk-000-20250228-221025" -> null
          - managed_disk_type         = "Premium_LRS" -> null
          - name                      = "atlassianprodconfluence02-datadisk-000-20250228-221025" -> null
          - write_accelerator_enabled = false -> null
            # (1 unchanged attribute hidden)
        }

      + storage_image_reference { # forces replacement
          + id        = "RedHat:RHEL:7.8:7.8.2021051701"
          + version   = (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ storage_os_disk {
          ~ create_option             = "Attach" -> "FromImage"
          ~ disk_size_gb              = 256 -> (known after apply)
          ~ managed_disk_id           = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/disks/atlassianprodconfluence02-osdisk-20250228-221025" -> (known after apply)
            name                      = "atlassianprodconfluence02-osdisk-20250228-221025"
          ~ os_type                   = "Linux" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # azurerm_virtual_machine.vm["atlassian-prod-confluence-04"] must be replaced
-/+ resource "azurerm_virtual_machine" "vm" {
      + availability_set_id              = (known after apply)
      ~ id                               = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-confluence-04" -> (known after apply)
      + license_type                     = (known after apply)
        name                             = "atlassian-prod-confluence-04"
        tags                             = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
      - zones                            = [] -> null
        # (7 unchanged attributes hidden)

      ~ storage_data_disk (known after apply)
      - storage_data_disk {
          - caching                   = "ReadOnly" -> null
          - create_option             = "Attach" -> null
          - disk_size_gb              = 128 -> null
          - lun                       = 0 -> null
          - managed_disk_id           = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/disks/atlassianprodconfluence04-datadisk-000-20250228-221041" -> null
          - managed_disk_type         = "Premium_LRS" -> null
          - name                      = "atlassianprodconfluence04-datadisk-000-20250228-221041" -> null
          - write_accelerator_enabled = false -> null
            # (1 unchanged attribute hidden)
        }

      + storage_image_reference { # forces replacement
          + id        = "RedHat:RHEL:7.8:7.8.2021051701"
          + version   = (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ storage_os_disk {
          ~ create_option             = "Attach" -> "FromImage"
          ~ disk_size_gb              = 128 -> (known after apply)
          ~ managed_disk_id           = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/disks/atlassianprodconfluence04-osdisk-20250228-221041" -> (known after apply)
            name                      = "atlassianprodconfluence04-osdisk-20250228-221041"
          ~ os_type                   = "Linux" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # azurerm_virtual_machine.vm["atlassian-prod-crowd-01"] must be replaced
-/+ resource "azurerm_virtual_machine" "vm" {
      + availability_set_id              = (known after apply)
      ~ id                               = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-crowd-01" -> (known after apply)
      + license_type                     = (known after apply)
        name                             = "atlassian-prod-crowd-01"
        tags                             = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
      - zones                            = [] -> null
        # (7 unchanged attributes hidden)

      ~ storage_data_disk (known after apply)

      + storage_image_reference { # forces replacement
          + id        = "RedHat:RHEL:7.8:7.8.2021051701"
          + version   = (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ storage_os_disk {
          ~ create_option             = "Attach" -> "FromImage"
          ~ disk_size_gb              = 64 -> (known after apply)
          ~ managed_disk_id           = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/disks/atlassianprodcrowd01-osdisk-20250228-220949" -> (known after apply)
            name                      = "atlassianprodcrowd01-osdisk-20250228-220949"
          ~ os_type                   = "Linux" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # azurerm_virtual_machine.vm["atlassian-prod-gluster-01"] must be replaced
-/+ resource "azurerm_virtual_machine" "vm" {
      + availability_set_id              = (known after apply)
      ~ id                               = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-gluster-01" -> (known after apply)
      + license_type                     = (known after apply)
        name                             = "atlassian-prod-gluster-01"
        tags                             = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
      - zones                            = [] -> null
        # (7 unchanged attributes hidden)

      ~ storage_data_disk (known after apply)
      - storage_data_disk {
          - caching                   = "ReadWrite" -> null
          - create_option             = "Attach" -> null
          - disk_size_gb              = 4000 -> null
          - lun                       = 0 -> null
          - managed_disk_id           = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/disks/atlassianprodgluster01-datadisk-000-20250228-221117" -> null
          - managed_disk_type         = "Premium_LRS" -> null
          - name                      = "atlassianprodgluster01-datadisk-000-20250228-221117" -> null
          - write_accelerator_enabled = false -> null
            # (1 unchanged attribute hidden)
        }
      - storage_data_disk {
          - caching                   = "None" -> null
          - create_option             = "Attach" -> null
          - disk_size_gb              = 1024 -> null
          - lun                       = 1 -> null
          - managed_disk_id           = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/disks/atlassianprodgluster01-datadisk-001-20250228-221117" -> null
          - managed_disk_type         = "StandardSSD_LRS" -> null
          - name                      = "atlassianprodgluster01-datadisk-001-20250228-221117" -> null
          - write_accelerator_enabled = false -> null
            # (1 unchanged attribute hidden)
        }

      + storage_image_reference { # forces replacement
          + id        = "RedHat:RHEL:7.8:7.8.2021051701"
          + version   = (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ storage_os_disk {
          ~ create_option             = "Attach" -> "FromImage"
          ~ disk_size_gb              = 64 -> (known after apply)
          ~ managed_disk_id           = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/disks/atlassianprodgluster01-osdisk-20250228-221117" -> (known after apply)
            name                      = "atlassianprodgluster01-osdisk-20250228-221117"
          ~ os_type                   = "Linux" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # azurerm_virtual_machine.vm["atlassian-prod-gluster-02"] must be replaced
-/+ resource "azurerm_virtual_machine" "vm" {
      + availability_set_id              = (known after apply)
      ~ id                               = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-gluster-02" -> (known after apply)
      + license_type                     = (known after apply)
        name                             = "atlassian-prod-gluster-02"
        tags                             = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
      - zones                            = [] -> null
        # (7 unchanged attributes hidden)

      ~ storage_data_disk (known after apply)
      - storage_data_disk {
          - caching                   = "ReadWrite" -> null
          - create_option             = "Attach" -> null
          - disk_size_gb              = 4000 -> null
          - lun                       = 0 -> null
          - managed_disk_id           = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/disks/atlassianprodgluster02-datadisk-000-20250228-221141" -> null
          - managed_disk_type         = "Premium_LRS" -> null
          - name                      = "atlassianprodgluster02-datadisk-000-20250228-221141" -> null
          - write_accelerator_enabled = false -> null
            # (1 unchanged attribute hidden)
        }

      + storage_image_reference { # forces replacement
          + id        = "RedHat:RHEL:7.8:7.8.2021051701"
          + version   = (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ storage_os_disk {
          ~ create_option             = "Attach" -> "FromImage"
          ~ disk_size_gb              = 64 -> (known after apply)
          ~ managed_disk_id           = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/disks/atlassianprodgluster02-osdisk-20250228-221141" -> (known after apply)
            name                      = "atlassianprodgluster02-osdisk-20250228-221141"
          ~ os_type                   = "Linux" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # azurerm_virtual_machine.vm["atlassian-prod-gluster-03"] must be replaced
-/+ resource "azurerm_virtual_machine" "vm" {
      + availability_set_id              = (known after apply)
      ~ id                               = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-gluster-03" -> (known after apply)
      + license_type                     = (known after apply)
        name                             = "atlassian-prod-gluster-03"
        tags                             = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
      - zones                            = [] -> null
        # (7 unchanged attributes hidden)

      ~ storage_data_disk (known after apply)
      - storage_data_disk {
          - caching                   = "ReadWrite" -> null
          - create_option             = "Attach" -> null
          - disk_size_gb              = 4000 -> null
          - lun                       = 0 -> null
          - managed_disk_id           = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/disks/atlassianprodgluster03-datadisk-000-20250228-221204" -> null
          - managed_disk_type         = "Premium_LRS" -> null
          - name                      = "atlassianprodgluster03-datadisk-000-20250228-221204" -> null
          - write_accelerator_enabled = false -> null
            # (1 unchanged attribute hidden)
        }

      + storage_image_reference { # forces replacement
          + id        = "RedHat:RHEL:7.8:7.8.2021051701"
          + version   = (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ storage_os_disk {
          ~ create_option             = "Attach" -> "FromImage"
          ~ disk_size_gb              = 64 -> (known after apply)
          ~ managed_disk_id           = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/disks/atlassianprodgluster03-osdisk-20250228-221204" -> (known after apply)
            name                      = "atlassianprodgluster03-osdisk-20250228-221204"
          ~ os_type                   = "Linux" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # azurerm_virtual_machine.vm["atlassian-prod-jira-01"] must be replaced
-/+ resource "azurerm_virtual_machine" "vm" {
      + availability_set_id              = (known after apply)
      ~ id                               = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-jira-01" -> (known after apply)
      + license_type                     = (known after apply)
        name                             = "atlassian-prod-jira-01"
        tags                             = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
      - zones                            = [] -> null
        # (7 unchanged attributes hidden)

      ~ storage_data_disk (known after apply)
      - storage_data_disk {
          - caching                   = "ReadOnly" -> null
          - create_option             = "Attach" -> null
          - disk_size_gb              = 100 -> null
          - lun                       = 0 -> null
          - managed_disk_id           = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/disks/atlassianprodjira01-datadisk-000-20250228-220516" -> null
          - managed_disk_type         = "Premium_LRS" -> null
          - name                      = "atlassianprodjira01-datadisk-000-20250228-220516" -> null
          - write_accelerator_enabled = false -> null
            # (1 unchanged attribute hidden)
        }

      + storage_image_reference { # forces replacement
          + id        = "RedHat:RHEL:7.8:7.8.2021051701"
          + version   = (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ storage_os_disk {
          ~ create_option             = "Attach" -> "FromImage"
          ~ disk_size_gb              = 80 -> (known after apply)
          ~ managed_disk_id           = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/disks/atlassianprodjira01-osdisk-20250228-220516" -> (known after apply)
            name                      = "atlassianprodjira01-osdisk-20250228-220516"
          ~ os_type                   = "Linux" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # azurerm_virtual_machine.vm["atlassian-prod-jira-02"] must be replaced
-/+ resource "azurerm_virtual_machine" "vm" {
      + availability_set_id              = (known after apply)
      ~ id                               = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-jira-02" -> (known after apply)
      + license_type                     = (known after apply)
        name                             = "atlassian-prod-jira-02"
        tags                             = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
      - zones                            = [] -> null
        # (7 unchanged attributes hidden)

      ~ storage_data_disk (known after apply)

      + storage_image_reference { # forces replacement
          + id        = "RedHat:RHEL:7.8:7.8.2021051701"
          + version   = (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ storage_os_disk {
          ~ create_option             = "Attach" -> "FromImage"
          ~ disk_size_gb              = 64 -> (known after apply)
          ~ managed_disk_id           = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/disks/atlassianprodjira02-osdisk-20250228-220712" -> (known after apply)
            name                      = "atlassianprodjira02-osdisk-20250228-220712"
          ~ os_type                   = "Linux" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # azurerm_virtual_machine.vm["atlassian-prod-jira-03"] must be replaced
-/+ resource "azurerm_virtual_machine" "vm" {
      + availability_set_id              = (known after apply)
      ~ id                               = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-jira-03" -> (known after apply)
      + license_type                     = (known after apply)
        name                             = "atlassian-prod-jira-03"
        tags                             = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
      - zones                            = [] -> null
        # (7 unchanged attributes hidden)

      ~ storage_data_disk (known after apply)

      + storage_image_reference { # forces replacement
          + id        = "RedHat:RHEL:7.8:7.8.2021051701"
          + version   = (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ storage_os_disk {
          ~ create_option             = "Attach" -> "FromImage"
          ~ disk_size_gb              = 64 -> (known after apply)
          ~ managed_disk_id           = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/disks/atlassianprodjira03-osdisk-20250228-220737" -> (known after apply)
            name                      = "atlassianprodjira03-osdisk-20250228-220737"
          ~ os_type                   = "Linux" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # azurerm_virtual_machine_data_disk_attachment.data_disk_attachment["atlassianprodconfluence02-datadisk-000-20250228-221025"] must be replaced
-/+ resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachment" {
      ~ id                        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-confluence-02/dataDisks/atlassianprodconfluence02-datadisk-000-20250228-221025" -> (known after apply)
      ~ virtual_machine_id        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-confluence-02" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_data_disk_attachment.data_disk_attachment["atlassianprodconfluence04-datadisk-000-20250228-221041"] must be replaced
-/+ resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachment" {
      ~ id                        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-confluence-04/dataDisks/atlassianprodconfluence04-datadisk-000-20250228-221041" -> (known after apply)
      ~ virtual_machine_id        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-confluence-04" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_data_disk_attachment.data_disk_attachment["atlassianprodgluster01-datadisk-000-20250228-221117"] must be replaced
-/+ resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachment" {
      ~ id                        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-gluster-01/dataDisks/atlassianprodgluster01-datadisk-000-20250228-221117" -> (known after apply)
      ~ virtual_machine_id        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-gluster-01" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_data_disk_attachment.data_disk_attachment["atlassianprodgluster01-datadisk-001-20250228-221117"] must be replaced
-/+ resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachment" {
      ~ id                        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-gluster-01/dataDisks/atlassianprodgluster01-datadisk-001-20250228-221117" -> (known after apply)
      ~ virtual_machine_id        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-gluster-01" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_data_disk_attachment.data_disk_attachment["atlassianprodgluster02-datadisk-000-20250228-221141"] must be replaced
-/+ resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachment" {
      ~ id                        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-gluster-02/dataDisks/atlassianprodgluster02-datadisk-000-20250228-221141" -> (known after apply)
      ~ virtual_machine_id        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-gluster-02" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_data_disk_attachment.data_disk_attachment["atlassianprodgluster03-datadisk-000-20250228-221204"] must be replaced
-/+ resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachment" {
      ~ id                        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-gluster-03/dataDisks/atlassianprodgluster03-datadisk-000-20250228-221204" -> (known after apply)
      ~ virtual_machine_id        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-gluster-03" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_data_disk_attachment.data_disk_attachment["atlassianprodjira01-datadisk-000-20250228-220516"] must be replaced
-/+ resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachment" {
      ~ id                        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-jira-01/dataDisks/atlassianprodjira01-datadisk-000-20250228-220516" -> (known after apply)
      ~ virtual_machine_id        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-jira-01" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

Plan: 25 to add, 4 to change, 16 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":72,"Program":"tfcmt","SHA1":"","Target":"prod_general - TerraformPlanApply","Vars":{}} -->